# 刑法总论

---

## 刑法概述

### 刑法的概念、性质与渊源

### 刑法的指导思想、根据与任务

### 刑法的改革与发展

### 刑法的体系与解释

---

## 刑法的基本原则

### 保障人权原则

### 罪刑法定原则

### 刑法面前人人平等原则

### 罪责相适应原则

### 其他基本原则
#### 罪责自负原则
#### 主客观相统一原则

---

## 刑法的适用范围

### 空间效力
#### 属地管辖权
#### 属人管辖权
#### 保护管辖权
#### 普通管辖权

### 时间效力
#### 生效时间
#### 失效时间
#### 刑法溯及力
##### 从旧原则
##### 从新原则
##### 从旧兼从轻原则：我国
##### 从新建从轻原则

---

## 犯罪论

### 犯罪的概念

### 犯罪的构成
#### 四要件：判断一个行为是否构成犯罪的标准
##### 主体要件
##### 客体要件
##### 主观要件
##### 客观要件
#### 三阶层
##### 构成要件的该当性
###### 主体：不讨论责任能力
###### 行为：危害行为
###### 结果： 危害结果，法益侵害的表现
- 实害结果
- 危险
    - 具体危险犯：结合场景判断是否犯罪
    - 抽象危险犯：实施行为即犯罪
##### 违法性 
##### 有责性

### 排除社会危害性的行为
#### 正当防卫
#### 紧急避险

### 故意犯罪的停止形态
#### 犯罪既遂
#### 犯罪预备
#### 犯罪中止
#### 犯罪未遂

### 共同犯罪
#### 共同犯罪的成立条件
##### 共同过失犯罪
##### 片面犯罪
#### 共同犯罪的种类和刑事责任
##### 主犯
##### 从犯
##### 教唆犯
##### 胁从犯

### 数罪形态
#### 罪数的概述
#### 一罪类型
##### 实质的一罪(一行为造成一个或数个结果)
###### 继续犯
是指作用于同一对象的一个犯罪行为从着手实行到行为终了，犯罪行为与不法状态同时处于继续状态的犯罪。如非法监禁罪。
- 必须是只有一个犯罪行为
- 必须是持续地作用于同一对象
- 必须是犯罪行为与不法状态的继续

###### 想象竞合犯
行为人实施一个行为触犯数个罪名，且数个罪名之间不存在包含与交叉关系的犯罪形态
- 法规竞合：存在包含或者交叉关系
— 处罚原则：从一重罪处断

###### 结果加重犯
是指实施基本犯罪构成要件的行为，发生基本犯罪构成要件以外的重结果，因而刑法规定加重处罚的犯罪形态。如虐待致人重伤、死亡，非法拘禁致人重伤、死亡等。
##### 法定的一罪
###### 结合犯
是指数个各自独立的犯罪行为，根据刑法的明文规定，结合成为另一个独立的新罪的犯罪形态。（同一时间、同一地点、针对同一犯罪人实行的行为）
###### 集合犯
是指行为人一实施不定次数的同种犯罪行为为目的，反复实施数个同种犯罪行为，但刑法规定作为一罪处理的犯罪形态。又可分为常习犯（如赌博罪）和营业罪（如非法行医罪）
##### 处断的一罪
###### 连续犯
是指行为人基于数个同一的犯罪故意，连续多次实施数个性质相同的犯罪行为，触犯同一罪名的犯罪形态。
###### 牵连犯
是指行为人实施某种犯罪（即本罪），而方法行为或者结果又触犯其他罪名（即他罪）的犯罪形态。
###### 吸收犯
是指行为人实施数个犯罪行为，因其所符合的犯罪构成之间具有特定的依附关系，从而导致其中一个不具有独立性的犯罪，被另一个具有独立性的犯罪所吸收，对行为人仅以吸收之最论处，而对被吸收之罪则置之不论的犯罪形态
#### 数罪类型
##### 异种数罪和同种数罪
异种数罪和同种数罪，是以行为人的犯罪事实符合数个犯罪构成的性质是否一致为标准，对数罪所进行的分类。
- 异种数罪：行为人的犯罪事实符合数个性质不同的犯罪构成的犯罪形态

---

## 刑罚论

### 刑罚体系：静态刑罚
#### 主刑
##### 自由刑
###### 管制
###### 拘役
###### 有期徒刑
###### 无期徒刑
##### 生命刑
###### 死刑
#### 附加刑
##### 财产刑
###### 罚金
###### 没收财产
##### 资格刑
###### 剥夺政治权利
###### 驱逐出境

### 刑罚运用时效：动态刑罚
#### 量刑
##### 量刑原则、情节
##### 累犯
##### 自首
##### 立功
##### 数罪并罚
##### 缓刑
#### 行刑
##### 减刑
##### 假释

### 刑罚消灭制度
#### 追诉时效
#### 赦免

### 非刑罚处罚措施
#### 赔偿经济损失
#### 责令赔偿损失
#### 责令具结悔过
#### 训诫
#### 责令赔礼道歉
#### 行政处罚
#### 并罪免刑
